Бух_тест/src/ExchangePlans/ОбменУправлениеНебольшойФирмойБухгалтерия20/ОбменУправлениеНебольшойФирмойБухгалтерия20.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="a5d9fd51-ca2c-4bbd-9036-b097dd061c61">
  <name>ОбменУправлениеНебольшойФирмойБухгалтерия20</name>
  <attributes>
    <name>ДатаНачалаВыгрузкиДокументов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКонтрагент</name>
    <comment>Для платежных документов</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <comment>Для документов передачи в производство</comment>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСклад</name>
    <comment>Склад готовой продукции</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяПрочихДоходовРасходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияРасходов</name>
    <type>
      <types>CatalogRef.СпособыОтраженияРасходовПоАмортизации</types>
    </type>
  </attributes>
  <attributes>
    <name>УслугаПоВознаграждению</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыгрузкиПриНеобходимости</name>
    <type>
      <types>EnumRef.РежимыВыгрузкиОбъектовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнойОбмен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьДокументыИзБухгалтерииПредприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаОтправкиДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>27</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыгрузкиДокументов</name>
    <type>
      <types>EnumRef.РежимыВыгрузкиОбъектовОбмена</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

Бух_тест/src/Enums/РежимыВыгрузкиОбъектовОбмена/РежимыВыгрузкиОбъектовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыВыгрузкиОбъектовОбмена</name>
  <enumValues>
    <name>ВыгружатьВсегда</name>
    <comment>Выгрузка без использования фильтров</comment>
  </enumValues>
  <enumValues>
    <name>ВыгружатьПоУсловию</name>
    <comment>Выгрузка с использованием фильтров</comment>
  </enumValues>
  <enumValues>
    <name>ВыгружатьПриНеобходимости</name>
    <comment>Выгрузка без использования фильтров, но с контролем ссылочной целостности выгружаемых данных</comment>
  </enumValues>
  <enumValues>
    <name>ВыгружатьВручную</name>
    <comment>В этом режиме изменения объектов не регистрируются автоматически (через подписки на события); объекты регистрируются к выгрузке вручную пользователем и выгружаются только, если соответствуют фильтру, установленному на узле, для которого выполняется выгруз</comment>
  </enumValues>
  <enumValues>
    <name>НеВыгружать</name>
    <comment>В этом режиме изменения объектов не регистрируются автоматически (через подписки на события) и не выгружаются, даже если изменения объектов были зарегистрированы вручную пользователем.</comment>
  </enumValues>
</mdclass:Enum>

Бух_тест/src/ExchangePlans/ОбменУправлениеНебольшойФирмойБухгалтерия20/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		
		Если НЕ ЗначениеЗаполнено(РежимВыгрузкиПриНеобходимости) Тогда
			РежимВыгрузкиПриНеобходимости = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ИспользоватьОтборПоОрганизациям И Организации.Количество() <> 0 Тогда
		Организации.Очистить();
	ИначеЕсли Организации.Количество() = 0 И ИспользоватьОтборПоОрганизациям Тогда
		ИспользоватьОтборПоОрганизациям = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПравилаОтправкиДокументов) Тогда
		ПравилаОтправкиДокументов = "АвтоматическаяСинхронизация";
	КонецЕсли;
	
	Если ПравилаОтправкиДокументов = "НеСинхронизировать" Тогда
		РежимВыгрузкиДокументов = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать;
	Иначе
		РежимВыгрузкиДокументов = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//Создание предопределенных элементов для значений по умолчанию.
	
	Если ЗначениеЗаполнено(СтатьяЗатрат) Тогда
		
		Назначение = "ПрочиеЗатраты";
		ОбработатьИмяПредопределенныхДанных(СтатьяЗатрат, Назначение);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтатьяПрочихДоходовРасходов) Тогда
		
		Назначение = "ПрочиеВнереализационныеДоходыРасходы";
		ОбработатьИмяПредопределенныхДанных(СтатьяПрочихДоходовРасходов, Назначение);
		
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура ОбработатьИмяПредопределенныхДанных(СсылкаНаЭлемент, Назначение)
	
	Если Не ЗначениеЗаполнено(Назначение) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		СтарыйПредопределенный = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник." + СсылкаНаЭлемент.Метаданные().Имя + "." + Назначение);
		Если ЗначениеЗаполнено(СтарыйПредопределенный) И СтарыйПредопределенный <> СсылкаНаЭлемент Тогда
			
			СтарыйОбъект = СтарыйПредопределенный.ПолучитьОбъект();
			СтарыйОбъект.Заблокировать();
			СтарыйОбъект.ИмяПредопределенныхДанных = "";
			СтарыйОбъект.Записать();                                 			
			СтарыйОбъект.Разблокировать();
			
		КонецЕсли;
		
		Объект = СсылкаНаЭлемент.ПолучитьОбъект();
		Объект.ИмяПредопределенныхДанных = Назначение;
		Объект.Записать();
		
	Исключение
		
		СобытиеЖурнала = НСтр("ru='Данные.Изменение';uk='Дані.Зміна'");
		
		ТекстСообщения = НСтр("ru='Не удалось установить предопределенным объект';uk=""Не вдалося встановити напередвизначеним об'єкт""") + " '" + СсылкаНаЭлемент + "'!
			|"+ ОписаниеОшибки();
		
		ЗаписьЖурналаРегистрации(СобытиеЖурнала,
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные(),
			Ссылка,
			ТекстСообщения
		);
	КонецПопытки;
	
КонецПроцедуры


#КонецЕсли
